nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/cmsis_driver_examples/lpi2c/int_b2b_transfer/master/pin_mux.h
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPI2C0_InitPins(void);

/*! @name PORT3_0 (coord U12), P3_0/J4[12]
  @{ */

/* Symbols to be used with PORT driver */
#define LPI2C0_DEINITPINS_LPI2C1_SCL_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define LPI2C0_DEINITPINS_LPI2C1_SCL_PIN 0U                   /*!<@brief PORT pin number */
#define LPI2C0_DEINITPINS_LPI2C1_SCL_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_0 (coord U12), P3_0/J4[12]
  @{ */

/* Symbols to be used with PORT driver */
#define LPI2C0_DEINITPINS_LPI2C1_SCL_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define LPI2C0_DEINITPINS_LPI2C1_SCL_PIN 0U                   /*!<@brief PORT pin number */
#define LPI2C0_DEINITPINS_LPI2C1_SCL_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_1 (coord R12), P3_1/J4[10]
  @{ */

/* Symbols to be used with PORT driver */
#define LPI2C0_DEINITPINS_LPI2C1_SDA_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define LPI2C0_DEINITPINS_LPI2C1_SDA_PIN 1U                   /*!<@brief PORT pin number */
#define LPI2C0_DEINITPINS_LPI2C1_SDA_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_12 (coord P15), P3_12/U15[8]
  @{ */

/* Symbols to be used with PORT driver */
#define LPI2C0_DEINITPINS_LPI2C0_SCL_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define LPI2C0_DEINITPINS_LPI2C0_SCL_PIN 12U                   /*!<@brief PORT pin number */
#define LPI2C0_DEINITPINS_LPI2C0_SCL_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT3_13 (coord P16), P3_13/U15[1]
  @{ */

/* Symbols to be used with PORT driver */
#define LPI2C0_DEINITPINS_LPI2C0_SDA_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define LPI2C0_DEINITPINS_LPI2C0_SDA_PIN 13U                   /*!<@brief PORT pin number */
#define LPI2C0_DEINITPINS_LPI2C0_SDA_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief This is a de-initialization function for 'LPI2C0_InitPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void LPI2C0_DeinitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
